#include <stdarg.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>


#if defined(_WIN32)
  #define OS_WINDOWS
#elif defined(__linux__)
  #define OS_LINUX
  #if defined(ANDROID) || defined(__ANDROID__)
    #define OS_ANDROID
  #endif
#elif defined(__APPLE__)
  #include <TargetConditionals.h>
  #if TARGET_IPHONE_SIMULATOR
     #define OS_IOS
  #elif TARGET_OS_IPHONE
    #define OS_IOS
  #elif TARGET_OS_MAC
    #define OS_MAC
  #else
    #error "Unsupported Apple platform!"
  #endif
#else
  #error "Unsupported platform!"
#endif

#if defined(__amd64__) || defined(__amd64) || defined(__x86_64__) || defined(__x86_64) || defined(_M_X64) || defined(_M_AMD64)
  #define ARCHITECTURE_X64 1
#elif defined(i386) || defined(__i386) || defined(__i386__) || defined(_X86_) || defined(_M_IX86)
  #define ARCHITECTURE_X86 1
#elif defined(__aarch64__) || defined(_M_ARM64)
  #define ARCHITECTURE_ARM64 1
#elif defined(__arm__) && defined(__ARM_ARCH_7A__)
  #define ARCHITECTURE_ARM_V7 1
#else
  #error "Unsupported architecture!"
#endif

#if defined(ARCHITECTURE_ARM_V7)
#define ARCHITECTURE_SUPPORTS_UNALIGNED_MEMORY_ACCESS 0
#else
#define ARCHITECTURE_SUPPORTS_UNALIGNED_MEMORY_ACCESS 1
#endif

#if defined(_MSC_VER)
  #define COMPILER_MSVC
#elif defined(__clang__)
  #define COMPILER_CLANG
#elif defined(__GNUC__)
  #define COMPILER_GCC
#elif defined(__INTEL_COMPILER)
  #define COMPILER_INTEL
#elif defined(__MINGW32__)
  #define COMPILER_MINGW
#else
  #error "Unsupported compiler."
#endif

#if defined(COMPILER_MSVC)
#include <intrin.h>
#elif defined(COMPILER_GCC) || defined(COMPILER_CLANG)
  #if defined(ARCHITECTURE_X86) || defined(ARCHITECTURE_X64)
#include <cpuid.h>
#include <wmmintrin.h>
  #endif
extern "C" long syscall(long, ...) __THROW;
#endif

#ifndef LEAKCHECK
#include "libraries/lk_region.h"
#endif

#define ApplicationNamespace            wc
#define EnterApplicationNamespace       namespace ApplicationNamespace {
#define ExitApplicationNamespace        }


#include "colorbars.h"
#include "debug.h"

EnterApplicationNamespace


////////////////////////////////////////////////////////////////////////////////
// Helper macros
////////////////////////////////////////////////////////////////////////////////


#define Concatenate__(x, y) x##y
#define Concatenate_(x, y)  Concatenate__(x, y)
#define Concatenate(x, y)   Concatenate_(x, y)

#define UniqueIdentifier(name) Concatenate(_##name##_, __COUNTER__)

#define ArrayCount(array) (sizeof(array) / sizeof(*(array)))
#define ZeroStruct(address) memset(address, 0, sizeof(*(address)));
#define ZeroStaticArray(array) memset(array, 0, sizeof(array));

#if defined(COMPILER_GCC) || defined(COMPILER_CLANG)
#define Unreachable    { assert(false && "unreachable code"); __builtin_unreachable(); }
#define NotImplemented { assert(false && "not implemented");  __builtin_unreachable(); }
#define IllegalDefaultCase default: { assert(false && "illegal default case - unreachable code"); __builtin_unreachable(); break; }
#else
#define Unreachable assert(false && "unreachable code");
#define NotImplemented assert(false && "not implemented");
#define IllegalDefaultCase default: { assert(false && "illegal default case - unreachable code"); break; }
#endif

#define MemberSize(Type, member) sizeof(((Type*) NULL)->member)
#define MemberOffset(Type, member) ((umm) &((Type*) NULL)->member)


// Almost equivalent to R"XXX(what you pass in)XXX", except it collapses whitespace
// into a single space character. Use in macros, to avoid the MSVC line number bug.
#define CodeString(...) #__VA_ARGS__

#define CodeString_s(...) #__VA_ARGS__##_s


#define CACHE_SIZE 64
#define CacheAlign alignas(CACHE_SIZE)


#if defined(COMPILER_MSVC)
#define ForceInline __forceinline
#elif defined(COMPILER_GCC) || defined(COMPILER_CLANG)
#define ForceInline inline __attribute__((always_inline))
#else
#define ForceInline inline
#endif

#define IgnoreUnused(x) ((void)(x))

// Defer

template <typename F>
struct Defer_RAII
{
    F f;
    Defer_RAII(F f): f(f) {}
    ~Defer_RAII() { f(); }
};

template <typename F>
Defer_RAII<F> defer_function(F f)
{
    return Defer_RAII<F>(f);
}

#define Defer(code)   auto UniqueIdentifier(defer) = defer_function([&] () { code; })


#define For(container) for (auto* it : container)

#define Loop(name)                 \
    if (0)                         \
    {                              \
        name##_break:    break;    \
        name##_continue: continue; \
    } else

#define BreakLoop(name)    goto name##_break
#define ContinueLoop(name) goto name##_continue



#define CompileTimeAssert(test) static_assert((test), "Compile-time assertion (" #test ") failed!")


// Placing a constexpr expression in a constexpr context is the only way to force evaluation.
// And this is also really necessary in practice, because C++ compilers are ass.
// Hence, this garbage:
#define CompileTimeU32(x) (sizeof(byte(&)[(x) + 1]) - 1)
// +1 is there because C++ doesn't allow zero-sized objects.
// Also keep in mind, because of compiler-imposed static array size limits, the value of
// this integer is limited to 2^31 - 2 inclusive.


#define GlobalBlock GlobalBlock_(UniqueIdentifier(global_block))
#define GlobalBlock_(name) GlobalBlock__(name)
#define GlobalBlock__(name) \
    static struct name##_struct \
    { \
        typedef void Lambda(); \
        inline name##_struct(Lambda* f) { f(); } \
    } name##_instance = (name##_struct::Lambda*) []()

#define GlobalCleanupBlock GlobalCleanupBlock_(UniqueIdentifier(global_cleanup_block))
#define GlobalCleanupBlock_(name) GlobalCleanupBlock__(name)
#define GlobalCleanupBlock__(name) \
    static struct name##_struct \
    { \
        typedef void Lambda(); \
        void(*f)(); \
        inline name##_struct(void(*f)()): f(f) {} \
        inline ~name##_struct() { f(); } \
    } name##_instance = (name##_struct::Lambda*) []()

#if defined(COMPILER_MSVC)
// Thread-local initializer
// Note: Very poorly implemented on non-MSVC compilers. Constructors and destructors
// might not get called. Therefore, this is not defined for those compilers.

#define ThreadLocalBlock ThreadLocalBlock_(UniqueIdentifier(thread_local_block))
#define ThreadLocalBlock_(name) ThreadLocalBlock__(name)
#define ThreadLocalBlock__(name) \
    static thread_local struct name##_struct \
    { \
        typedef void Lambda(); \
        inline name##_struct(void(*f)()) { f(); } \
    } name##_instance = (name##_struct::Lambda*) []()

#define ThreadLocalCleanupBlock ThreadLocalCleanupBlock_(UniqueIdentifier(thread_local_cleanup_block))
#define ThreadLocalCleanupBlock_(name) ThreadLocalCleanupBlock__(name)
#define ThreadLocalCleanupBlock__(name) \
    static thread_local struct name##_struct \
    { \
        typedef void Lambda(); \
        Lambda* f; \
        inline name##_struct(Lambda* f): f(f) {} \
        inline ~name##_struct() { f(); } \
    } name##_instance = (name##_struct::Lambda*) []()

#endif

// Only once

#define OnlyOnce OnlyOnce_(UniqueIdentifier(only_once))
#define OnlyOnce_(name) OnlyOnce__(name)
#define OnlyOnce__(name)                                         \
    static Atomic32 name;                                        \
    static Atomic32 name##_lock;                                 \
    if (!load(&name))                                            \
    {                                                            \
        while (!compare_exchange(&name##_lock, 0, 1));           \
        if (!load(&name))                                        \
        {                                                        \
            goto name##_start;                                   \
            name##_end:                                          \
            exchange(&name, 1);                                  \
        }                                                        \
        exchange(&name##_lock, 0);                               \
    }                                                            \
    if (0) while (1)                                             \
        if (1) goto name##_end;                                  \
        else name##_start:


template<typename T>
inline void swap(T* a, T* b)
{
    T temp = *a;
    *a = *b;
    *b = temp;
}


////////////////////////////////////////////////////////////////////////////////
// Primitive types
////////////////////////////////////////////////////////////////////////////////


typedef int8_t  s8;
typedef int16_t s16;
typedef int32_t s32;
typedef int64_t s64;
CompileTimeAssert(sizeof(s8)  == 1);
CompileTimeAssert(sizeof(s16) == 2);
CompileTimeAssert(sizeof(s32) == 4);
CompileTimeAssert(sizeof(s64) == 8);

constexpr s8  S8_MAX  = 0x7fl;
constexpr s16 S16_MAX = 0x7fffl;
constexpr s32 S32_MAX = 0x7fffffffl;
constexpr s64 S64_MAX = 0x7fffffffffffffffll;

constexpr s8  S8_MIN  = (s8)  0x80ul;
constexpr s16 S16_MIN = (s16) 0x8000ul;
constexpr s32 S32_MIN = (s32) 0x80000000ul;
constexpr s64 S64_MIN = (s64) 0x8000000000000000ull;

typedef uint8_t  u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef uint64_t u64;
CompileTimeAssert(sizeof(u8)  == 1);
CompileTimeAssert(sizeof(u16) == 2);
CompileTimeAssert(sizeof(u32) == 4);
CompileTimeAssert(sizeof(u64) == 8);

constexpr u8  U8_MAX  = 0xfful;
constexpr u16 U16_MAX = 0xfffful;
constexpr u32 U32_MAX = 0xfffffffful;
constexpr u64 U64_MAX = 0xffffffffffffffffull;

#if defined(ARCHITECTURE_X86) || defined(ARCHITECTURE_ARM_V7)
typedef s32 smm;
typedef u32 umm;
constexpr smm SMM_MIN = S32_MIN;
constexpr smm SMM_MAX = S32_MAX;
constexpr umm UMM_MAX = U32_MAX;
#else
typedef s64 smm;
typedef u64 umm;
constexpr smm SMM_MIN = S64_MIN;
constexpr smm SMM_MAX = S64_MAX;
constexpr umm UMM_MAX = U64_MAX;
#endif

CompileTimeAssert(sizeof(smm) == sizeof(void*));
CompileTimeAssert(sizeof(umm) == sizeof(void*));

typedef u8 byte;

typedef u8  bool8;
typedef u16 bool16;
typedef u32 bool32;
typedef u64 bool64;

typedef u8  flags8;
typedef u16 flags16;
typedef u32 flags32;
typedef u64 flags64;

typedef u8  mask8;
typedef u16 mask16;
typedef u32 mask32;
typedef u64 mask64;

typedef float  f32;
typedef double f64;
CompileTimeAssert(sizeof(f32) == 4);
CompileTimeAssert(sizeof(f64) == 8);

constexpr double F64_MAX = 1.7976931348623158e308;
constexpr float  F32_MAX = 3.402823466e38f;

#define Low8(v16)   (u8 )(v16)
#define Low16(v32)  (u16)(v32)
#define Low32(v64)  (u32)(v64)
#define High8(v16)  (u8 )(((u16)(v16)) >> 8)
#define High16(v32) (u16)(((u32)(v32)) >> 16)
#define High32(v64) (u32)(((u64)(v64)) >> 32)


typedef u64 File_Time;
constexpr File_Time PAST_TIME   = 1ull << 16;  // 01 Jan 1601 00:00:01
constexpr File_Time FUTURE_TIME = 1ull << 61;  // 05 Dec 8907 18:42:01


#define IsPowerOfTwo(x) ((x & (x - 1)) == 0)  // zero considered pow2


inline f32 f32_from_bits(u32 x) { union { u32 i; f32 f; } u; u.i = x; return u.f; }
inline f64 f64_from_bits(u64 x) { union { u64 i; f64 f; } u; u.i = x; return u.f; }
inline u32 bits_from_f32(f32 x) { union { u32 i; f32 f; } u; u.f = x; return u.i; }
inline u64 bits_from_f64(f64 x) { union { u64 i; f64 f; } u; u.f = x; return u.i; }

